<template lang="pug">
	article.article-view
		header.header
			h1.__title {{ article.title }}

			.__row.row.justify-content-between
				.__col.col-auto.mw-100
					time.__datetime(
						:datetime="new Date(article.date).toISOString()"
						:title="`${dateString} ${timeString}`"
					)
						| {{ dateString }}

		.content(v-html="article.content")
</template>

<script>
	export default {
		name: "ArticleView",
		data() {
			return {
				article: {
					id: 0,
					date: 0,
					title: '',
					content: '',
				},
			};
		},
		computed: {
			dateString() {
				return new Date(this.article.date).toLocaleDateString('ru', {
					year: 'numeric',
					month: 'long',
					day: '2-digit',
				});
			},
			timeString() {
				return new Date(this.article.date).toLocaleTimeString('ru', {
					hour: '2-digit',
					minute: '2-digit',
					second: '2-digit',
				});
			},
		},
		created() {
			// Example: get data async
			setTimeout(() => {
				this.article = {
					id: 1,
					date: Date.now(),
					title: 'Вентиляция в сауне и парилке h1',
					content: `
						<p>Воздух, насыщенный кислородом, жизненно необходим людям.
						Особенно, если человек находится в закрытом пространстве.
						Поэтому вентиляция в сауне, бане, ванной комнате и других помещениях с повышенной
						температурой и уровнем влажности должна быть обустроена правильно.
						В противном случае можно столкнуться с массой неприятных сюрпризов
						и их негативными последствиями.</p>

						<p>Самое главное помещение любой сауны или бани – это, безусловно, парилка.
						А в парилке высокая температура во многом зависит именно от вентиляции, да и не только она,
						но и качество отдыха. Какая польза от горячего воздуха,
						если он застоявшийся и пропитанный запахами сырости и продуктами потоотделения?</p>

						<h2>Самое главное помещение любой сауны или бани — парилка. h2</h2>
						<p>Кроме того, не нужно забывать, что любая парилка – это место с повышенной влажностью,
						а значит и повышенной опасностью для всех элементов (особенно деревянных) стать рассадником
						плесени и грибка. Да и какая сауна сейчас обходится без электрики?
						Даже при минимуме электрического оборудования нужно провести банальный свет,
						сделать включатель – вот и риск получить удар током при повышенной влажности!</p>

						<p>Чтобы не пришлось постоянно думать о повышенной влажности, лучше один раз подумать
						о качественной вентиляции. Подумать, конечно, будет мало – нужно еще и реализовать
						правильно замысел! Еще со школьных времен всем нам известно, что у горячего воздуха есть
						одна ярко выраженная особенность – он всегда стремится.</p>

						<p class="text-center"><img src="upload/ventilyatsiya.jpg" alt=""></p>

						<h3>Основные проблемы при отсутсвии вентиляции в сауне h3</h3>
						<p>Основные проблемы, с которыми предстоит встретиться при неправильно обустроенной
						или вовсе отсутствующей системе вентиляции в домашней сауне с электрокаменкой, следующие:</p>

						<ul>
							<li>недостаток кислорода;</li>
							<li>неприятный запах;</li>
							<li>гниение конструкций;</li>
							<li>сокращенный срок службы помещения;</li>
							<li>сквозняки;</li>
							<li>повышенный расход топлива для нагрева.</li>
						</ul>

						<h4>Если нету притока свежего уличного воздуха сразу несколько человек h4</h4>
						<p>Все эти признаки или только часть из них один за другим начнут появляться в сауне/бане,
						имеющей неработающую вентиляцию. Если нету притока свежего уличного воздуха, а в парилке находится
						сразу несколько человек, то существует опасность угореть. Особенно, если отдыхающие находятся
						в состоянии алкогольного опьянения, что, к сожалению, нередко можно встретить.
						<strong>Относительно неприятного запаха, то он появляется из-за скопления пота и недостаточного
						удаления влаги в помещении</strong>.
						Ведь при отсутствии вентиляции просушить парилку после использования проблематично – нужно
						открывать двери и следить, чтобы все хорошенько проветрилось и высохло. Причем, это касается всех
						комнат – для отдыха, купания, раздевалок и прочих, построенных предусмотрительным хозяином.</p>

						<ol>
							<li>недостаток кислорода;</li>
							<li>неприятный запах;</li>
							<li>гниение конструкций;</li>
							<li>сокращенный срок службы помещения;</li>
							<li>сквозняки;</li>
							<li>повышенный расход топлива для нагрева.</li>
						</ol>

						<h5>Если нету притока свежего уличного воздуха сразу несколько человек h5</h5>

						<h6>Если нету притока свежего уличного воздуха сразу несколько человек H6</h6>
						<p>Все эти признаки или только часть из них один за другим начнут появляться в сауне/бане,
						имеющей неработающую вентиляцию. Если нету притока свежего уличного воздуха, а в парилке
						находится сразу несколько человек, то существует опасность угореть. Особенно, если отдыхающие
						находятся в состоянии алкогольного опьянения, что, к сожалению, нередко можно встретить.
						<strong>Относительно неприятного запаха, то он появляется из-за скопления пота и недостаточного
						удаления влаги в помещении</strong>.
						Ведь при отсутствии вентиляции просушить парилку после использования проблематично – нужно
						открывать двери и следить, чтобы все хорошенько проветрилось и высохло.
						Причем, это касается всех комнат – для отдыха, купания, раздевалок и прочих,
						построенных предусмотрительным хозяином.</p>

						<blockquote>Все эти признаки или только часть из них один за другим начнут появляться в сауне/бане,
						имеющей неработающую вентиляцию. Если нету притока свежего уличного воздуха, а в парилке находится
						сразу несколько человек, то существует опасность угореть.</blockquote>
					`
				};
			}, 100);
		},
	}
</script>

<style lang="scss" scoped>
	.article-view {
		@include reset;
	}

	.header {
		&__title {
			@include reset;

			font-family: var(--content-headings-font-family);
			font-weight: var(--content-headings-font-weight);
			font-size: var(--content-h1-font-size);
			line-height: var(--content-headings-line-height);
			color: var(--content-headings-color);
			margin-bottom: 0.5rem;
		}

		&__datetime {
			font-weight: 300;
			font-size: calc(var(--content-font-size) * 14 / 16);
			line-height: 1.25;
			color: var(--content-headings-color);
		}
	}
</style>
